Page({
  data: {
    activeNames: ['0'],
    colleges: [
      {
        id: '1',
        name: '信息科学与技术学院',
        majors: ['计算机科学与技术','电子信息工程','网络工程','信息管理与信息系统','通信工程','物联网工程','信息科学与大数据技术(2020年新增)',]
      },
        {
        id: '2',
        name: '人文与社会科学学院',
        majors: ['行政管理','社会工作','文化产业管理(2020年新增)',]
        },
        {
        id: '3',
        name: '何香凝艺术设计学院',
        majors: ['产品设计','环境设计','视觉传达设计',]
        },
        {
        id: '4',
        name: '管理学院(2020起在白云校区招生)',
        majors: ['工商管理','会计学','财务管理','人力资源管理','市场营销',]
        },
        {
          id: '5',
          name: '自动化学院(2020起在白云校区招生)',
          majors: ['电气工程及其自动化','电气工程及其自动化(双学位国际班)','自动化','机器人工程',]
          },
        {
        id: '6',
        name: '园艺园林学院',
        majors: ['园林','园艺','草业科学',]
        },
        {
        id: '7',
        name: '农业与生物学院',
        majors: ['生物科学(原生物科学类大类招生)','生物技术(原生物科学类大类招生)','种子科学与工程','植物保护','农学','生物科学类(国际班,2020年新增)',]
        },
        {
        id: '8',
        name: '计算机科学学院',
        majors: ['统计学','信息与科学技术',]
        },
        {
        id: '9',
        name: '经贸学院',
        majors: ['国际经济与贸易','会展经济与管理','投资学','农业经济管理',]
        },
        {
        id: '10',
        name: '轻工食品学院',
        majors: ['食品科学与工程','食品科学与工程(国际班)','食品质量与安全','生物工程','包装工程',]
        },
        {
        id: '11',
        name: '机电工程学院',
        majors: ['机械电子工程','机械设计制造及其自动化','能源与动力工程',]
        },
        {
        id: '12',
        name: '化学化工学院',
        majors: ['应用化学','化学工程与工艺','高分子材料与工程','材料化学',]
        },
        {
        id: '13',
        name: '资源与环境学院',
        majors: ['资源环境科学','环境科学','环境工程',]
        },
        {
          id: '14',
          name: '外国语学院',
          majors: ['商务英语','英语','日语',]
        },
        {
          id: '15',
          name: '城乡建设学院',
          majors: ['土木工程(双学位国际班)','城乡规划','广告学(土木工程','给排水科学与工程',]
        },
        {
        id: '16',
        name: '动物科技学院',
        majors: ['动物医学','动物科学','水产养殖学',]
        }
        
  ]
  },
  onChange(event) {
    wx.showToast({
      title: '加载中',
      icon : "loading",
      duration : 500
    })
    this.setData({
      activeNames: event.detail,
    });
  },
});