// pages/handbook/antifraud.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    antifraud : [{
      info : '新生入学这段时间是骗子聚集日，各种各样的骗子，大家都需要留意，凡是涉及到钱款的交谈，无论是师兄还是师姐，务必慎重对待。'
    }, {
      info : '1.几乎每个宿舍都配了柜子，大家刚刚来到寝室的时候，可以自带一两个小锁，在出入的时候把自己带来的贵重物品放到柜子里面锁起来，因为到时候寝室人流量很大，管理会变得宽松，难免会有顺手牵羊的人。'
    }, {
      info : '2.开学伊始，会有很多师兄师姐来寝室进行推销，有一些会假冒成本校的师兄师姐，要十分警惕这些假冒的师兄师姐，如有遇到，最好让他们出示学生证件或者直接告知不需要。之前就有骗子冒充过来推销学习用品之类的，有新生被骗了1000多块钱。'
    }, {
      info : '3.一定要注意保护自己的个人信息，大家上大学后要逐渐有这种保护信息的意识，在网上或者线下，有时候会有什么问卷调查或者活动让你填一下电话号码或者专业班级信息，这时候就要谨慎，因为后面你也许会收到各种各样的推销电话。  '
    }, {
      info : '4.开学可能每个宿舍都会买洗衣机，学校没有配洗衣机但允许使用，这时候也会有很多的师兄师姐来推销，大家购买的时候也要注意对方的真实身份，一般洗衣机的价格在500-800元，如果价格太高可以果断放弃。'
    }, {
      info : '5.注意诈骗信息，不要相信网贷，多要好的熟人给你推荐的网贷都不要参与；另外，学校不会私下给你发任何的信息和邮件，如果收到任何来自教务处或者学院的邮件或者信息，百分之百是诈骗信息，一定不要点开，像在QQ某些群中可能会出现录取名单为名字的文档，很多人点进去之后就会被盗号，所有的信息都可以去官方网站查询，警惕小道消息。'
    }, {
      info : '6.注意人身安全，三水校区处在较为冷清的地带，无论是男生还是女生，请不要独自出校门，特别是东门之外或者西门的小路里面。女生要注意搭讪的陌生人，如果遇到可以直接拒绝并走开，与其保持距离或者寻求校警帮助。'
    }, {
      info : '7.大家要防止自己的善良被利用，有些骗子的手法是装可怜，然后说自己多少天没有吃饭了，这时候你可能会想去帮助他，他说想去哪里哪里吃饭，你可以给他十块八块，但千万不要跟着去，因为那里可能会有一群人在等着趁你不注意把你绑架拐卖了。'
    }]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})