// pages/handbook/miltrain.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    miltrain : [
      {
        info : '1.每年的九月份，广财会在三水校区和广州校区同时进行军训，一般是在开学的第一周，为期 14-15 天。'
      },
      {
        info : '2.军训期间穿着全套军训服，开学后会根据各自的尺码去买，有两套军装加一双鞋子，一般价格在140元左右。军训期间不允许穿自己的鞋子，并且有些教官可能会要求你穿外套，有一些不让你穿。'
      },
      {
        info : '3.军训的鞋底很硬，而且配的那个垫子几乎不起作用，最好自己买一些厚软一点的鞋垫。（垫卫生巾也能达到同样的效果）。'
      },
      {
        info : '4.军训是早上 7:40 - 11:30，下午 15:00 - 17:20，晚上 18:40 - 20:30（时间每年或许会不同），有些教官可能会稍微拖一下，导致晚饭时间很短，而那时候饭堂人又很多，急的话可以考虑西门外的一些餐厅。'
      },
      {
        info : '5.军训期间是很晒的，需要及时补充水分，但也不需要买杯子，因为教官可能不给自带杯子（影响军容），一般都是买那种大瓶的矿泉水（可以排的整整齐齐）。'
      },
      {
        info : '6.防晒霜是必不可少的，在暑假期间就备好防晒霜，但防晒霜不防晒黑（如果有这种牌子请介绍给我），只能够减少晒伤的，起到保护作用。'
      },
      {
        info : '7.准备一些清凉油或者藿香正气水，在休息期间可以涂一下或喝一瓶，以防中暑；准备针线盒，军训服的质量比较差，有可能会有扣子掉落等情况，有针线就可以自己缝补。'
      },
      {
        info : '8.军训期间有什么问题及时跟教官或者班助说明，中暑、感冒、发烧或者生理期可以直接去校医院就医，医生开证明后可以免训。免训也要参加军训，不过是坐在阴凉处观训（俗称飞虎队），飞虎队可能需要写文章或者学习手语操。'
      }
    ],
    prompt : [
      {
        info : '1.出门前要认真检查军训服装是否穿戴整齐，如军帽、帽徽、腰带、肩章等。女生记得扎好头发，可以用发夹夹好帽子，以防军训时帽子松动。'
      },
      {
        info : '2.注意补充营养，军训时体力消耗极大，这个时候不要亏待自己，多吃一些肉类、蛋类，最好还多喝点汤菜类，同时注意补充各种维生素。一定要吃好早餐！'
      },
      {
        info : '3.注意防晒：出门前半小时就要涂防晒霜，重点涂抹部位：颈部、领口、耳朵。防晒霜最好随身带，在休息时间或教官允许后涂。'
      },
      {
        info : '4.按时作息：军训时间按时作息，特别是午休期间一定要安静休息，养精蓄锐，为漫漫军训路打下坚实的基础。'
      }
    ],
    miltrainImag : [
      {
        imag : 'https://note.youdao.com/yws/api/personal/file/WEBdad5b3c41973e723948daf1ae2f04ac9?method=download&shareKey=8af4fc6048eab9bceab9c1fcaae097c5'
      },
      {
        imag : 'https://note.youdao.com/yws/api/personal/file/WEB9ee0260061d674fb6fe9688fa417c130?method=download&shareKey=105e17dab62234ffd0e7406737b6bac3'
      },
      {
        imag : 'https://note.youdao.com/yws/api/personal/file/WEBb1aaffb732b52e0ca8deb79e6716bdee?method=download&shareKey=03faeb01b7226666164a4142fac33f14'
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },
  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})