// pages/schoolhandbook/suggestion.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    suggestion : [
      {
        info : '1.近年来文、理科出档分数线和排位较高，尤其是经、管、法类专业备受考生青睐。建议文科排名23000以内，理科排名70000以内的考生大胆填报。'
      },{
      info : '2.第一专业志愿至关重要，填报时应当极其慎重，所选专业的热门度应尽量与自己分数相符或略低于预期，切忌盲目冲高；'
    }, {
      info : '3.第一至第六专业志愿间应拉开足够的梯度，做到冷热搭配，切忌六个专业志愿都填报相对热门的专业；'
    }, {
      info : '4.尽可能将六个专业志愿都填满，并选择一至两个自己可以接受的相对冷门专业保底。同时，在服从专业调剂的前提下，把自己最不愿意修读的专业填入不服从调剂专业选项内，避免六个专业志愿都无法录取时被调剂到最不喜欢的专业。'
    },]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})